<a href="https://colab.research.google.com/github/dharmendra-chouhan/s2datascience/blob/master/Costing_Sheet_Dec_2019_with_All_annexures.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [97]:
#@title *Read a Excel file from a Google drive** {display-mode: "form"}
!pip install -U -q PyDrive
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials

# 1. Authenticate and create the PyDrive client.
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

#2. Get the file Cosolidated sheet for Dec 2019_Annexure-3.xlsx
downloaded = drive.CreateFile({'id':'1c_dTYm16Vp9JhvB2EUu8A7x0E6869Vtj'}) # replace the id with id of file you want to access
downloaded.GetContentFile('Cosolidated sheet for Dec 2019_Annexure-3.xlsx')  

# HLL Expenses Summary-Annexure-II.xlsx
downloaded = drive.CreateFile({'id':'1NaFIGXdD7WMiMIpjkkNSCi2m4YOtSIR9'}) # replace the id with id of file you want to access
downloaded.GetContentFile('HLL Expenses Summary-Annexure-II.xlsx')

# Lab Wise Business Report_Annexure-I.xls
downloaded = drive.CreateFile({'id':'1W31V3JFrzJDpcOIOHlpCY6ETrfxTU5Ue'}) # replace the id with id of file you want to access
downloaded.GetContentFile('Lab Wise Business Report_Annexure-I.xls')

# Rent for Dec 19_Annexure-5.xlsx
downloaded = drive.CreateFile({'id':'1-UvqUpH-2pZV9_MS97Fuetp5E26U72VH'}) # replace the id with id of file you want to access
downloaded.GetContentFile('Rent for Dec 19_Annexure-5.xlsx')

import pandas as pd

#3. Read file as panda dataframe 

# Cosolidated sheet for Dec 2019_Annexure-3.xlsx
dfCosolidated_sheet_for_Dec_2019_Annexure_3 =  pd.read_excel('Cosolidated sheet for Dec 2019_Annexure-3.xlsx', sheet_name='Sheet1', skiprows=1)

# HLL Expenses Summary-Annexure-II.xlsx
dfhll_exp_sum_aII_CONSUMABLES =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='CONSUMABLES', skiprows=1)
dfhll_exp_sum_aII_RENT =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='RENT', skiprows=1)
dfhll_exp_sum_aII_THYROCARE =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='THYROCARE', skiprows=1)
dfhll_exp_sum_aII_PATHOLOGIST =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='PATHOLOGIST', skiprows=1)

# Lab Wise Business Report_Annexure-I.xls
dflab_wise_business_Ann_I =  pd.read_excel('Lab Wise Business Report_Annexure-I.xls')
dflab_wise_business_Ann_I=dflab_wise_business_Ann_I.drop([0])

# Rent for Dec 19_Annexure-5.xlsx
dfRentDec19_Annexure_5 =  pd.read_excel('Rent for Dec 19_Annexure-5.xlsx', sheet_name='Sheet1', skiprows=2)

# Datafram EXCEL sheet wise

```
# Cosolidated sheet for Dec 2019_Annexure-3.xlsx
  1. dfCosolidated_sheet_for_Dec_2019_Annexure_3
```
```
# HLL Expenses Summary-Annexure-II.xlsx
  2. dfhll_exp_sum_aII_CONSUMABLES
  3. dfhll_exp_sum_aII_RENT
  4. dfhll_exp_sum_aII_THYROCARE
  5. dfhll_exp_sum_aII_PATHOLOGIST
```
```
# Lab Wise Business Report_Annexure-I.xls
  6. dflab_wise_business_Ann_I
```
```
# Rent for Dec 19_Annexure-5.xlsx
  7.dfRentDec19_Annexure_5
```

In [117]:
#@title *Cosolidated sheet for Dec 2019_Annexure-3.xlsx* {display-mode: "form"}
dfCosolidated_sheet_for_Dec_2019_Annexure_3.head(2)

   Sr No.  User ID  ... Work From date Total Pay
0     1.0   9332.0  ...     15/02/2019    8000.0
1     2.0   9485.0  ...     05/03/2019    7500.0

[2 rows x 8 columns]

In [102]:
#@title *Cosolidated sheet for Dec 2019_Annexure-3.xlsx(info)* {display-mode: "form"}
dfCosolidated_sheet_for_Dec_2019_Annexure_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3345 entries, 0 to 3344
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Sr No.          3339 non-null   float64
 1   User ID         3339 non-null   float64
 2   Designation     3339 non-null   object
 3   District        3339 non-null   object
 4   Lab             3339 non-null   object
 5   Resource Name   3341 non-null   object
 6   Work From date  3340 non-null   object
 7   Total Pay       3343 non-null   float64
dtypes: float64(3), object(5)
memory usage: 209.2+ KB

In [118]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --Consumbles* {display-mode: "form"}
dfhll_exp_sum_aII_CONSUMABLES = dfhll_exp_sum_aII_CONSUMABLES.rename(columns={'Location': 'Lab'})
dfhll_exp_sum_aII_CONSUMABLES.head(2)

        Lab             Supplier Name  ... POSTING DATE Unnamed: 7
0  Kharghar  JAINAM/TULIP DIAGNOSTICS  ...   2019-05-23        NaN
1  Kharghar  JAINAM/TULIP DIAGNOSTICS  ...   2019-05-23        NaN

[2 rows x 8 columns]

In [119]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info) --Consumbles* {display-mode: "form"}
dfhll_exp_sum_aII_CONSUMABLES.info(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Lab            180 non-null    object
 1   Supplier Name  180 non-null    object
 2   PO No.         180 non-null    object
 3   Invoice No     180 non-null    object
 4   Invoice Amt    181 non-null    int64
 5   Invoice Date   180 non-null    datetime64[ns]
 6   POSTING DATE   127 non-null    datetime64[ns]
 7   Unnamed: 7     0 non-null      float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 11.4+ KB

In [120]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --Rent* {display-mode: "form"}
dfhll_exp_sum_aII_RENT = dfhll_exp_sum_aII_RENT.rename(columns={'LAB LOCATION': 'Lab'})
dfhll_exp_sum_aII_RENT.head(2)

  SR .NO      Lab                       OWNERS NAME    DEC
0      1  MANCHAR            Namdev Dattatray Bende  18150
1      2  MANGAON  Mohammad Sharif Younus Harnekar   39930

In [106]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info)--Rent* {display-mode: "form"}
dfhll_exp_sum_aII_RENT.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SR .NO       78 non-null     object
 1   Lab          77 non-null     object
 2   OWNERS NAME  77 non-null     object
 3   DEC          78 non-null     int64
dtypes: int64(1), object(3)
memory usage: 2.6+ KB

In [121]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --Thyrocare* {display-mode: "form"}
dfhll_exp_sum_aII_THYROCARE = dfhll_exp_sum_aII_THYROCARE.rename(columns={'LOCATION': 'Lab'})
dfhll_exp_sum_aII_THYROCARE.head(2)

  Sr. No.         Lab  Sum of BILLED  Unnamed: 3
0       1    ACHALPUR       11118.01    11118.01
1       2  AHMEDNAGAR       15675.63         NaN

In [108]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info)--Thyrocare* {display-mode: "form"}
dfhll_exp_sum_aII_THYROCARE.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sr. No.        106 non-null    object
 1   Lab            105 non-null    object
 2   Sum of BILLED  106 non-null    float64
 3   Unnamed: 3     94 non-null     float64
dtypes: float64(2), object(2)
memory usage: 3.4+ KB

In [124]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --PATHOLOGIST* {display-mode: "form"}
dfhll_exp_sum_aII_PATHOLOGIST = dfhll_exp_sum_aII_PATHOLOGIST.rename(columns={'Lab Name': 'Lab'})
dfhll_exp_sum_aII_PATHOLOGIST.head(2)

   Sr. No     Employee Name  ...   DEC'19        JV NO.
0     1.0  Dr. Vijay Gawali  ...  80000.0  1.900201e+09
1     NaN               NaN  ...      NaN           NaN

[2 rows x 8 columns]

In [111]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info)--PATHOLOGIST* {display-mode: "form"}
dfhll_exp_sum_aII_PATHOLOGIST.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Sr. No                  103 non-null    float64
 1   Employee Name           103 non-null    object
 2   Vendor Code             103 non-null    float64
 3   Designation             103 non-null    object
 4   Lab                     141 non-null    object
 5   Salary revision if any  142 non-null    float64
 6   DEC'19                  104 non-null    float64
 7   JV NO.                  103 non-null    float64
dtypes: float64(5), object(3)
memory usage: 9.0+ KB

In [125]:
#@title *Lab Wise Business Report_Annexure-I.xls* {display-mode: "form"}
dflab_wise_business_Ann_I = dflab_wise_business_Ann_I.rename(columns={'Lab Name': 'Lab'})
dflab_wise_business_Ann_I.head(2)

  Division Name District Name  ... Claim Amount  RejectedPatientcount
1      AMRAVATI         Akola  ...   2059433.68                   0.0
2      AMRAVATI         Akola  ...    500517.96                   0.0

[2 rows x 15 columns]

In [113]:
#@title *Lab Wise Business Report_Annexure-I.xls (info)* {display-mode: "form"}
dflab_wise_business_Ann_I.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137 entries, 1 to 137
Data columns (total 15 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Division Name               137 non-null    object
 1   District Name               137 non-null    object
 2   Lab                         137 non-null    object
 3   Total Patient               137 non-null    int64
 4   Total Special               137 non-null    int64
 5   Total Normal                137 non-null    int64
 6   TAT MET                     137 non-null    int64
 7   TAT FAIL                    137 non-null    int64
 8   TAT MET %                   137 non-null    float64
 9   Total Revenue               137 non-null    float64
 10  Penalty(On Completed Test)  137 non-null    int64
 11  Penalty(On Pending Test)    137 non-null    int64
 12  Total Penalty               137 non-null    float64
 13  Claim Amount                137 non-null    float64
 14  RejectedPatientcount        137 non-null    float64
dtypes: float64(5), int64(7), object(3)
memory usage: 17.1+ KB

In [126]:
#@title *Rent for Dec 19_Annexure-5.xlsx - Sheet1* {display-mode: "form"}
dfRentDec19_Annexure_5 = dfRentDec19_Annexure_5.rename(columns={'Lab Location': 'Lab'})
dfRentDec19_Annexure_5.head(2)

   Sr.No.  ... Gross Rent
0     1.0  ...     7502.0
1     2.0  ...    14000.0

[2 rows x 6 columns]

In [116]:
#@title *Rent for Dec 19_Annexure-5.xlsx (info) - Sheet1* {display-mode: "form"}
dfRentDec19_Annexure_5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Sr.No.                 65 non-null     float64
 1   District               61 non-null     object
 2   Lab                    65 non-null     object
 3   Owner                  65 non-null     object
 4   Owner account details  65 non-null     object
 5   Gross Rent             66 non-null     float64
dtypes: float64(2), object(4)
memory usage: 3.2+ KB

In [174]:
dfCostingSheet = pd.DataFrame(dflab_wise_business_Ann_I.Lab.unique(),columns=['Lab'])
dfCostingSheet.head(25)

                      Lab
0                   Akola
1                   Akot
2              Murtizapur
3                Achalpur
4                Amravati
5                  Dharni
6                   Warud
7                Buldhana
8                Khamgaon
9                 Mehakar
10                Karanja
11                 Washim
12                   Arni
13  Pandharkhawad/Kelapur
14                  Pusad
15               Yavatmal
16             Aurangabad
17                 Kannad
18                 Sillod
19               Vaijapur
20                   Beed
21             Manjlegaon
22                 Parali
23                Hingoli
24               Jafrabad